/*矩阵A与矩阵B的乘积*/
#include <stdio.h>
int main()
{
	int a[3][4] = { {1,2,1,2},{0,1,3,1},{2,3,1,0} };
	int b[4][5] = { {2,1,1,2,1},{3,1,0,0,1},{1,0,1,2,0},{3,0,2,3,2} };
	int c[3][5] = { 0 };
	int i, j;
	int k;
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 5; j++)
		{
			for (k = 0; k < 4; k++)
			{
				c[i][j] += (a[i][k] * b[k][j]);//a与b每一次对应项乘积 a的行数与b的列数相等，所以可以用k来表示每一次乘积改变的元素
			}
		}
	}
	printf("矩阵A与矩阵B乘积AB=\n");
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 5; j++)
		{
			printf("%2d ", c[i][j]);
		}
		printf("\n");
	}
	return 0;
};
